In [2]:
import pandas as pd
import numpy as np

# DataFrame을 정의하는 두가지 방법

## 1.  list arguments(data, index, columns)

Data의 형태에 대해서, (m, n)의 경우 m개의 index와 n개의 columns가 필요하다.

In [7]:
data = np.arange(12).reshape((6, 2))
index = [['부산', '부산', '서울', '서울', '서울', '서울'],[2000, 2005, 2000, 2005, 2010, 2015]]
columns = ['데이터1', '데이터2']

In [10]:
columns

['데이터1', '데이터2']

In [12]:
df1 = pd.DataFrame(data, index = index, columns = columns)
df1

         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

## 2. dictionary

columns를 기준으로 dictionary형태로 채워넣는다.

In [17]:
df2 = pd.DataFrame({'': ['부산', '부산', '서울', '서울', '서울', '서울'], 
                    ' ': [2000, 2005, 2000, 2005, 2010, 2015],
                    '데이터1': [0, 2, 4, 6, 8, 10],
                    '데이터2': [1, 3, 5, 7, 9, 11]})
df2

             데이터1  데이터2
0  부산  2000     0     1
1  부산  2005     2     3
2  서울  2000     4     5
3  서울  2005     6     7
4  서울  2010     8     9
5  서울  2015    10    11



.unique()를 사용하여 중복된 것들이 제거된 항목들이 나온다

x값(독립변수)에 대해서는 columns[:-1]를 사용하여 구해보자

In [1]:
import numpy as np
import seaborn as sns

dataframe이 바뀌기를 원하면 inplace = True를 사용하자

## 시리즈 클래스

numpy의 1차원 배열과 비슷하지만, 값(value)와 인덱스(index)로 구성되어 있어 인덱스로 값을 참조할 수 있다.

값은 numpy array의 dtype을 가지며, 인덱스는 object로 정의된다.

In [3]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [9]:
s[1], s['인천']

(3448737, 2890451)

In [13]:
a = np.array([1,2,3])
b = np.array([4,5,6])

In [14]:
type(a)

numpy.ndarray